# Yosys full synthesis script
# Performs technology mapping and optimization
{{READ_FILES}}
hierarchy -auto-top
proc
flatten
opt
techmap
opt
clean
write_json {{JSON_OUTPUT}}
